MicrochipTech/AzureDemo_AVR-IoT_Wx/winc-fw-upgrade/flashing_env/WINC1500_IoT_REL_19_6_1_30MAY2018_ATmega4808-4809/src/Tools/at_commands/main.c
/**
 * \file
 *
 * \brief Main File of AT Commands Project
 *
 */
#include "main.h"
#include "iperf/Iperf.h"
#include "buffered_uart.h"
#include "at_cmd_handler/serial_input.h"
#include "serial_bridge/serial_bridge.h"
#include "at_cmd_handler/at_cmd_handler.h"

tstr_test_conn_status gstrAllStatus;
tstr_app_config gtstrApp_config;
tstrWifiInitParam gstrWifiParam;

volatile static uint8   gu8WDog = 0;

static tstrAt_cmd_content		gstrAt_cmdContent;
								//Header, numOfParams, encStart, encStop, paramSep, HelpSep AT+CFG=2[ECHO,1] or AT+CFG /?
static strAtCMD_Handler			gastrAtCMD_Handler[AT_MAX_COMMANDS_COUNT];
tpf_at_cmd_handler				pf_at_cmd_handler;

#define TEST_TLS
#define TEST_IPERF
#define TEST_POWER_SAVE

#define STRING_EOL		"\r\n"
#define STRING_HEADER	STRING_EOL"-- Atmel Corporation"\
						STRING_EOL"-- Wifi Atmel UART APP (DEMO)"STRING_EOL \
						"-- "BOARD_NAME""STRING_EOL \
						"-- Compiled: "__DATE__" "__TIME__""STRING_EOL

#define ESC_DATA_SEQ    "\033SDS:"
#define TIMER_RES       100
#define CMD_TIMEOUT     ((25 * 1000) / (TIMER_RES))

extern uint32_t gu32UDPSendTime;
extern uint32   gu32IperfPacketsToSend;
extern uint8_t  gu8UDPIperfRX, gu8TCPIperfRX;
extern uint32   gu32IPAddress;

static void sb_printf(const char *_format, ...)
{
}

extern uint8		gHTTPport[AT_MAX_PARAM_LENGTH];
extern uint8		gTLS;
extern HTTP_RXInfo	gHTTPInfo;
extern uint8		gHTTPChecksum;
extern SOCKET		gHTTPsock;

#define HEX2ASCII(x) (((x)>=10)? (((x)-10)+'A') : ((x)+'0'))

/*Growl Variables*/
static volatile uint8 gu8GrowlRsvd;
/*Settings Variables*/
static uint8 gau8MacAddr[] = MAC_ADDRESS;
static sint8 gacDeviceName[] = M2M_DEVICE_NAME;
/*Power Save Variables*/
static volatile uint8 gu8Sleep;
/*Scan Variables*/
static volatile uint8 gu8Index = 0;
/*Prov. Mode Data*/
tstrM2MProvisionInfo	*pstrProvInfo;

static volatile uint8 gu8Prov;
static volatile uint8 u8Socket_Opened = 0;

static uint32_t tick = 0;
static void timer_cb(void)
{
    tick++;

#ifdef CHAMBER_BUILD
    if(gu8WDog > 4) // User keeps sending invalid commands
    {
        M2M_INFO("Watchdog resetting the system...\n");
        NVIC_SystemReset();
    }
#endif
}

void m2m_wifi_resolve_handler(uint8* pu8DomainName, uint32 u32ServerIP)
{
	uint8 host_ip[4];
	uint8 next_command[] ="IPCON";
	uint8 protocol[] ="TCP";

	if(u32ServerIP == 0)
	{
		M2M_INFO("ERROR: DNS lookup failed\r\n");
	}
	else
	{
		host_ip[0] = u32ServerIP & 0xFF;
		host_ip[1] = (u32ServerIP >> 8) & 0xFF;
		host_ip[2] = (u32ServerIP >> 16) & 0xFF;
		host_ip[3] = (u32ServerIP >> 24) & 0xFF;

		M2M_INFO( "DNS lookup -> host: %s, IP addr:%u.%u.%u.%u\r\n", pu8DomainName, host_ip[0], host_ip[1], host_ip[2], host_ip[3]);

		memcpy(gstrAt_cmdContent.au8Cmd,next_command,sizeof(next_command));
		gstrAt_cmdContent.u8NumOfParameters = 5;
		memcpy(gstrAt_cmdContent.au8ParamsList[0],protocol,sizeof(protocol));
		sprintf((char *)gstrAt_cmdContent.au8ParamsList[1],"%u.%u.%u.%u", host_ip[0],host_ip[1],host_ip[2],host_ip[3]);
		memcpy(gstrAt_cmdContent.au8ParamsList[2],gHTTPport, AT_MAX_PARAM_LENGTH);
		gstrAt_cmdContent.au8ParamsList[3][0] = HEX2ASCII(gTLS);
		gstrAt_cmdContent.au8ParamsList[4][0]= HEX2ASCII(gHTTPChecksum);
	}
}

void m2m_wifi_socket_handler(SOCKET sock, uint8_t u8Msg, void *pvMsg)
{
	// Check for socket events
	if (u8Msg == SOCKET_MSG_BIND) {
		tstrSocketBindMsg *pstrBind = (tstrSocketBindMsg *)pvMsg;
		if (pstrBind && pstrBind->status == 0) {
			M2M_INFO("Bind success!");
			if(sock < TCP_SOCK_MAX)
				//TCP socket
				listen(sock,0);
			else 
			{
				//UDP socket
				M2M_INFO("Available CIDs:");
				PrintSockConnections(first_SockConn);
				recvfrom(sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
			}
		} else {
			close(sock);
			DeleteSockConn(&first_SockConn,sock);
			M2M_INFO("Available CIDs:");
			PrintSockConnections(first_SockConn);
			M2M_INFO("ERROR: Bind error!");
		}
	} else if (u8Msg == SOCKET_MSG_LISTEN) {
		tstrSocketListenMsg *pstrListen = (tstrSocketListenMsg *)pvMsg;
		if (pstrListen && pstrListen->status == 0) {
			M2M_INFO("Listen success!");
			M2M_INFO("Available CIDs:");
			PrintSockConnections(first_SockConn);
			accept(sock, NULL, NULL);
		} else {
			M2M_INFO("ERROR: Listen error!");
			close(sock);
			DeleteSockConn(&first_SockConn,sock);
			printf("Available CIDs:\n");
			PrintSockConnections(first_SockConn);
		}
	} else if (u8Msg == SOCKET_MSG_ACCEPT) {
		tstrSocketAcceptMsg *pstrAccept = (tstrSocketAcceptMsg *)pvMsg;
		if (pstrAccept) {
			uint8 sockCID;
			M2M_INFO("Accept success!");
			sockCID = AddSockConn(&first_SockConn, pstrAccept->sock, pstrAccept->strAddr.sin_port, pstrAccept->strAddr.sin_addr.s_addr);

			if(sockCID == 0xFF)
				M2M_INFO("ERR:Failed to add CID");
			else
			{
				M2M_INFO("Adding CID %d", sockCID);
				PrintSockConnections(first_SockConn);
				recv(pstrAccept->sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
			}
		} else {
			M2M_INFO("ERROR: Accept error!");
			close(sock);
		}
	} else if (u8Msg == SOCKET_MSG_CONNECT) {
		tstrSocketConnectMsg *pstrConnect = (tstrSocketConnectMsg *)pvMsg;
		if (pstrConnect) {
			if(pstrConnect->s8Error)
			{
				M2M_ERR("Socket connection failed! %d\n", pstrConnect->s8Error);
				close(pstrConnect->sock);
				DeleteSockConn(&first_SockConn,pstrConnect->sock);
			}
			else
			{
				SockConnInfo *pDestSockConn = NULL;
				pDestSockConn = RetrieveConnectionFromSocket(&first_SockConn, pstrConnect->sock);

				if(pDestSockConn->u16port == MQTT_PORT)
				{
					// Hardcoded MQTT connect message
					uint8 data_connect[26] = {0x10,0x18,0x00,0x04,0x4d,0x51,0x54,0x54,0x04,0x02,0x00,0x0a,0x00,0x0c,0x57,0x49,0x4e,0x43,0x33,0x34,0x30,0x30,0x5f,0x50,0x75,0x62};

					if(send(pstrConnect->sock, data_connect, sizeof(data_connect), 0) == M2M_SUCCESS)
					M2M_INFO("MQTT Connect packet sent");
					else
					M2M_INFO("ERROR: MQTT Connect error!");
				}
				recv(pstrConnect->sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
			}
			M2M_INFO("Available CIDs:");
			PrintSockConnections(first_SockConn);
		}
	} else if (u8Msg == SOCKET_MSG_RECV || u8Msg == SOCKET_MSG_RECVFROM) {
		uint8 u8RemoteIP[4];
		uint32 rmt_ip;
		uint16 rmt_port;
		tstrSocketRecvMsg *pstrRx = (tstrSocketRecvMsg *)pvMsg;
		SockConnInfo *pRemoteSockConn = NULL;

		if (pstrRx->pu8Buffer && pstrRx->s16BufferSize) {
			*(pstrRx->pu8Buffer+pstrRx->s16BufferSize) = '\0';

