MicrochipTech/AzureDemo_AVR-IoT_Wx/winc-fw-upgrade/flashing_env/WINC1500_IoT_REL_19_6_1_30MAY2018_ATmega4808-4809/src/Tools/at_commands/main.c
			pRemoteSockConn = RetrieveConnectionFromSocket(&first_SockConn, sock);

			if(pRemoteSockConn==NULL)
				M2M_INFO("ERROR: Receiving data from an unknown CID");

			if(sock < TCP_SOCK_MAX) 
			{
				// TCP socket
				if(gHTTPChecksum && sock == gHTTPsock)
				{
					uint8 * recv_chunk_ptr;
					uint16 recv_chunk_len;

					if(gHTTPInfo.first_chunk)
					{
						char* tmp_ptr;
						//Get the content-length
						tmp_ptr = strstr((char *)pstrRx->pu8Buffer, "Content-Length: ");
						//point to space before length
						tmp_ptr = strstr((char *)tmp_ptr, " "); 
						gHTTPInfo.content_len = atoi(tmp_ptr+1);

						tmp_ptr = strstr((char *)pstrRx->pu8Buffer, "\r\n\r\n");
						if(tmp_ptr) {
							recv_chunk_ptr = (uint8 *)(tmp_ptr+sizeof("\r\n\r\n")-1);
							recv_chunk_len =  pstrRx->s16BufferSize - ( (tmp_ptr - (char *)pstrRx->pu8Buffer) + 4);
						} else {
							M2M_ERR("ERROR: Unexpected condition in HTTP RSP!\r\n");
							recv_chunk_ptr = NULL;
							recv_chunk_len = 0;
						}
						gHTTPInfo.first_chunk = 0;
					}
					else {
						recv_chunk_ptr = pstrRx->pu8Buffer;
						recv_chunk_len = pstrRx->s16BufferSize;
					}
					if(recv_chunk_len > 0) {
						gHTTPInfo.rx_count += recv_chunk_len;
						M2M_INFO( "%lu bytes received\n", gHTTPInfo.rx_count);
						SHA1_UPDATE(&gHTTPInfo.sha1_ctxt, recv_chunk_ptr, (uint32)recv_chunk_len);
					}

					// Prepare next buffer reception
					memset(gau8SocketTestBuffer,0,sizeof(gau8SocketTestBuffer));
					recv(sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);

					if(gHTTPInfo.rx_count >= gHTTPInfo.content_len)
					{
						uint32 i;
						M2M_INFO( "EOF: Total bytes received = %lu\n", gHTTPInfo.rx_count);
						SHA1_FINISH(&gHTTPInfo.sha1_ctxt, gHTTPInfo.digest);
						for(i=0; i<sizeof(gHTTPInfo.digest); i++) {
							printf("%02x ", gHTTPInfo.digest[i]);
						}
						printf("\n\n");
					}
				} else
				{
					M2M_INFO("%s3[%d, %u, %s]", ESC_DATA_SEQ, pRemoteSockConn->u8CID, (pstrRx->s16BufferSize), pstrRx->pu8Buffer);
					// Prepare next buffer reception
					memset(gau8SocketTestBuffer,0,sizeof(gau8SocketTestBuffer));
					recv(sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
				}
			} else {
				// UDP socket
				rmt_ip = _ntohl(pstrRx->strRemoteAddr.sin_addr.s_addr);
				rmt_port = _ntohs(pstrRx->strRemoteAddr.sin_port);
				u8RemoteIP[0] = (uint8) ((rmt_ip & 0xFF000000)>>24);
				u8RemoteIP[1] = (uint8) ((rmt_ip & 0xFF0000)>>16);
				u8RemoteIP[2] = (uint8) ((rmt_ip & 0xFF00)>>8);
				u8RemoteIP[3] = (uint8) (rmt_ip & 0xFF);

				M2M_INFO("%s5[%d, %d.%d.%d.%d, %u, %u, %s]", ESC_DATA_SEQ, pRemoteSockConn->u8CID, u8RemoteIP[0], u8RemoteIP[1], u8RemoteIP[2], u8RemoteIP[3], rmt_port, (pstrRx->s16BufferSize), pstrRx->pu8Buffer);

				// Prepare next buffer reception
				memset(gau8SocketTestBuffer,0,sizeof(gau8SocketTestBuffer));
				recvfrom(sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
			}
		} else {
			if (pstrRx->s16BufferSize == SOCK_ERR_TIMEOUT) {
				// Prepare next buffer reception
				memset(gau8SocketTestBuffer,0,sizeof(gau8SocketTestBuffer));
				if(sock < TCP_SOCK_MAX) 
					//TCP socket
					recv(sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
				else 
					//UDP socket
					recvfrom(sock, gau8SocketTestBuffer, MAIN_WIFI_M2M_BUFFER_SIZE, 0);
			}
			if (pstrRx->s16BufferSize == SOCK_ERR_CONN_ABORTED) {
				M2M_ERR("Socket %d closed by remote server.\n",sock);
				DeleteSockConn(&first_SockConn,sock);
			}
		}
	}
}

static void OtaUpdateCb(uint8 u8OtaUpdateStatusType ,uint8 u8OtaUpdateStatus)
{
	M2M_INFO("%d %d\n",u8OtaUpdateStatusType,u8OtaUpdateStatus);

	if(u8OtaUpdateStatus == OTA_STATUS_SUCCESS) {
		if(u8OtaUpdateStatusType == DL_STATUS) {
			sint8 s8tmp;
			tstrM2mRev strtmp;

//			M2M_INFO("Curr driver HIF Level: %u\n", M2M_HIF_LEVEL);
			s8tmp = m2m_ota_get_firmware_version(&strtmp);
			if (M2M_ERR_FW_VER_MISMATCH == s8tmp)
			{
				// TODO application should update the host driver before switching to the upgraded firmware
			}

			M2M_INFO("OTA Firmware ver   : %u.%u.%u Svnrev %u\n", strtmp.u8FirmwareMajor, strtmp.u8FirmwareMinor, strtmp.u8FirmwarePatch,strtmp.u16FirmwareSvnNum);
			M2M_INFO("OTA Min driver ver : %u.%u.%u\n", strtmp.u8DriverMajor, strtmp.u8DriverMinor, strtmp.u8DriverPatch);
			M2M_INFO("OTA Curr driver ver: %u.%u.%u Svnrev %u\n", M2M_RELEASE_VERSION_MAJOR_NO, M2M_RELEASE_VERSION_MINOR_NO, M2M_RELEASE_VERSION_PATCH_NO,M2M_RELEASE_VERSION_SVN_VERSION);
			M2M_INFO("OTA Firmware Build %s Time %s\n",strtmp.BuildDate,strtmp.BuildTime);

			//switch to the upgraded firmware
			m2m_ota_switch_firmware();
		} else if(u8OtaUpdateStatusType == SW_STATUS) {
			M2M_INFO("Now OTA successfully done\n");
			M2M_INFO("Now will reset the system...");
			AT_SEND_OK("OTA_Update");
#if defined(__SAML21J18B__) || defined(__SAMD21J18A__)
			system_reset();
#elif defined(__SAM4SD32C__) || defined(__SAMG53N19__)
            NVIC_SystemReset();
#endif
		} else if (u8OtaUpdateStatusType == RB_STATUS) {
			M2M_INFO("Rollback successfully done\n");
			M2M_INFO("Now will reset the system...");
			AT_SEND_OK("OTA_RollBack");
#if defined(__SAML21J18B__) || defined(__SAMD21J18A__)
            system_reset();
#elif defined(__SAM4SD32C__) || defined(__SAMG53N19__)
            NVIC_SystemReset();
#endif
		} else if (u8OtaUpdateStatusType == HFD_STATUS) {
            AT_SEND_OK("HOST_OTA_Update started");
        }
	} else if (u8OtaUpdateStatus == OTA_STATUS_ABORTED) {
		M2M_INFO("OTA aborted by application");
	} else if (u8OtaUpdateStatus == OTA_STATUS_UPDATE_INPROGRESS){
		M2M_INFO("OTA status update in progress");
	} else if (u8OtaUpdateStatus == OTA_STATUS_ALREADY_ENABLED) {
		M2M_INFO("OTA status is already enabled");
	} else {
		M2M_INFO("ERROR:OTA Status:%d", u8OtaUpdateStatus);
		AT_SEND_ERROR(u8OtaUpdateStatus,"OTA");
	}
}

static void OtaNotifCb(tstrOtaUpdateInfo *pv)
{
    M2M_INFO("\n");
}

volatile uint32_t ms_systicks = 0;

#if defined(__SAML21J18B__) || defined(__SAMD21J18A__)
void SysTick_Handler(void)
{
    ms_systicks++;
}
#else
extern uint32_t ms_ticks;
#define ms_systicks ms_ticks
#endif

uint32 get_systicks(void)
{
	return ms_systicks;
}

sint32 GetScanTime(void)
{
	return (GetScanTimeStart()?(sint32)(ms_systicks - GetScanTimeStart()):-1);
}

sint32 GetDownloadTime(void)
{
	return (GetDownloadStartTime()?(sint32)(ms_systicks - GetDownloadStartTime()):-1);
}
static void wifi_cb(uint8 u8MsgType, void * pvMsg)
{
	uint8 au8CmdTxt[AT_MAX_CMD_LENGTH]={0};
	sint32 s32Scantime = 0;
	//AT_SEND_ERROR(u8MsgType,"WIFI CB");
	if (u8MsgType == M2M_WIFI_RESP_SCAN_DONE){
		tstrM2mScanDone *pstrInfo = (tstrM2mScanDone*) pvMsg;
		get_cmd_txt(AT_INDEX_SCAN, (uint8 *)au8CmdTxt);

		if(pstrInfo->s8ScanState == M2M_SUCCESS){
			s32Scantime = GetScanTime();
			uint8 index = strlen((const char *)au8CmdTxt);
			au8CmdTxt[index++]= '#';
			au8CmdTxt[index++]=((pstrInfo->u8NumofCh/10)+'0');
			au8CmdTxt[index++]=((pstrInfo->u8NumofCh%10)+'0');
			au8CmdTxt[index++]='\0';
			AT_SEND_OK(au8CmdTxt);
			M2M_INFO(">> Scan Time: %ld ms\r\n",s32Scantime);
			if(pstrInfo->u8NumofCh > 0) {
				M2M_INFO("\r#%02d%-9s\r\n",pstrInfo->u8NumofCh," ");
				M2M_INFO(">>#  %-3s %-4s %s %-17s SSID\r\n","RI","SEC","CH","BSSID");
			}
			gu8Index = 0;
			gu8Sleep = PS_WAKE;
			if (pstrInfo->u8NumofCh >= 1) {
				m2m_wifi_req_scan_result(gu8Index);
				gu8Index++;
			}
			else {
				M2M_INFO("No AP Found Rescan\n");
			}
		}
		else {
			AT_SEND_ERROR(pstrInfo->s8ScanState, au8CmdTxt);
		}
	}
	else if (u8MsgType == M2M_WIFI_RESP_SCAN_RESULT) {
		tstrM2mWifiscanResult		*pstrScanResult =(tstrM2mWifiscanResult*)pvMsg;
		uint8						u8NumFoundAPs = m2m_wifi_get_num_ap_found();

		char* authType;
		switch(pstrScanResult->u8AuthType)
		{
			case M2M_WIFI_SEC_OPEN:
				authType = "OPEN";
				break;
			case M2M_WIFI_SEC_WPA_PSK:
				authType = "WPA ";
				break;
			case M2M_WIFI_SEC_WEP:
				authType = "WEP ";
				break;
			case M2M_WIFI_SEC_802_1X:
				authType = "EAP ";
				break;
			default:
				authType = "?   ";
				break;
		}

