MicrochipTech/AzureDemo_AVR-IoT_Wx/winc-fw-upgrade/flashing_env/WINC1500_IoT_REL_19_6_1_30MAY2018_ATmega4808-4809/src/Tools/at_commands/main.c
		M2M_INFO(">>%02d %d %s %02d %02X:%02X:%02X:%02X:%02X:%02X %s\r\n",
			pstrScanResult->u8index+1,pstrScanResult->s8rssi,
			authType,pstrScanResult->u8ch,
			pstrScanResult->au8BSSID[0], pstrScanResult->au8BSSID[1], pstrScanResult->au8BSSID[2],
			pstrScanResult->au8BSSID[3], pstrScanResult->au8BSSID[4], pstrScanResult->au8BSSID[5],
			pstrScanResult->au8SSID
		);

		if(gu8Index < u8NumFoundAPs) {
			gu8Sleep = PS_WAKE;
			m2m_wifi_req_scan_result(gu8Index);
			gu8Index++;
		}
		else {
			gu8Sleep = PS_REQ_SLEEP;
		}
	}
	else if (u8MsgType == M2M_WIFI_RESP_CON_STATE_CHANGED) {
		tstrM2mWifiStateChanged *pstrWifiState = (tstrM2mWifiStateChanged*) pvMsg;
		//M2M_INFO("Wifi State :: %s ::\r\n", pstrWifiState->u8CurrState ? "CONNECTED" : "DISCONNECTED");

		switch(pstrWifiState->u8CurrState)
		{
			case M2M_WIFI_CONNECTED:
				M2M_INFO("Wifi State :: CONNECTED ::\r\n");
				break;
			case M2M_WIFI_DISCONNECTED:
				M2M_INFO("Wifi State :: DISCONNECTED ::\r\n");
				break;
			case M2M_ERR_CONN_INPROGRESS:
				M2M_INFO("Wifi Error :: CONNECTION IN PROGRESS ::\r\n");
				break;
			case M2M_WIFI_ROAMED:
				M2M_INFO("Wifi State :: CONNECTED ::\r\n");
				break;
		}

		if (pstrWifiState->u8CurrState == M2M_WIFI_CONNECTED) {
			gu8Sleep = PS_WAKE;

			if(use_static_IP)
			{
				get_cmd_txt(AT_INDEX_CONN, (uint8 *)au8CmdTxt);

				if(M2M_SUCCESS != m2m_wifi_set_static_ip(&StaticIPcfg)) 
					AT_SEND_ERROR(AT_ERR_OPERATION_NOT_COMPLETED, (uint8 *)au8CmdTxt);
				else
				{
					if(gstrAllStatus.u8P2p_status != SERVICE_IS_RUNNING) {
						gstrAllStatus.u8Sta_status = SERVICE_IS_RUNNING;
					}
					M2M_INFO("STA IP is static\r\n");
					AT_SEND_OK(au8CmdTxt);

					gu32IPAddress = StaticIPcfg.u32StaticIP;
				}
				use_static_IP = 0;
			}
		}
		else if(pstrWifiState->u8CurrState == M2M_WIFI_DISCONNECTED) {
			gu8Sleep = PS_WAKE;
			if(gstrAllStatus.u8Sta_status == SERVICE_IS_RUNNING) {
				gstrAllStatus.u8Sta_status = SERVICE_IS_STOPPED;
				get_cmd_txt(AT_INDEX_DISCONN, (uint8 *)au8CmdTxt);
				AT_SEND_OK(au8CmdTxt);
			}
			else {
				if(gstrAllStatus.u8Ap_status == SERVICE_DEV_IS_CONNECTED) {
					get_cmd_txt(AT_INDEX_DISCONN, (uint8 *)au8CmdTxt);
					gstrAllStatus.u8Ap_status = SERVICE_IS_RUNNING;
					AT_SEND_OK(au8CmdTxt);
				}
				else if(gstrAllStatus.u8P2p_status == SERVICE_DEV_IS_CONNECTED) {
					get_cmd_txt(AT_INDEX_DISCONN, (uint8 *)au8CmdTxt);
					gstrAllStatus.u8P2p_status = SERVICE_IS_RUNNING;
					AT_SEND_OK(au8CmdTxt);
				}
				else {
					if (gstrAllStatus.u8Ap_status == SERVICE_IS_UNDEFINED) {
						get_cmd_txt(AT_INDEX_AP_DISABLE, (uint8 *)au8CmdTxt);
						AT_SEND_OK(au8CmdTxt);
						gstrAllStatus.u8Ap_status = SERVICE_IS_STOPPED;
					}
					else if (gstrAllStatus.u8P2p_status == SERVICE_IS_UNDEFINED) {
						get_cmd_txt(AT_INDEX_P2P_DISABLE, (uint8 *)au8CmdTxt);
						AT_SEND_OK(au8CmdTxt);
						gstrAllStatus.u8P2p_status = SERVICE_IS_STOPPED;
					}
					else {
						get_cmd_txt(AT_INDEX_CONN, (uint8 *)au8CmdTxt);
						AT_SEND_ERROR(AT_ERR_OPERATION_NOT_COMPLETED, (uint8 *)au8CmdTxt);
					}
				}
			}
		}
	}
	else if(u8MsgType == M2M_WIFI_RESP_DEFAULT_CONNECT)	{
		tstrM2MDefaultConnResp	*pstrResp = (tstrM2MDefaultConnResp*)pvMsg;
		get_cmd_txt(AT_INDEX_DEF_CONN, (uint8 *)au8CmdTxt);
		if((pstrResp->s8ErrorCode == M2M_DEFAULT_CONN_EMPTY_LIST) || (pstrResp->s8ErrorCode == M2M_DEFAULT_CONN_SCAN_MISMATCH))	{
			M2M_INFO("Cached Networks not found or empty");
			AT_SEND_ERROR(pstrResp->s8ErrorCode,au8CmdTxt);
		}
	}
	else if(u8MsgType == M2M_WIFI_REQRSP_DELETE_APID) {
		tstrM2MGenericResp *pstrResp = (tstrM2MGenericResp*)pvMsg;
		if(pstrResp->s8ErrorCode == M2M_SUCCESS)
			M2M_INFO("Credential Delete Req succeeded");
		else
			M2M_INFO("Credential Delete Req failed");
	}
	else if (u8MsgType == M2M_WIFI_REQ_DHCP_CONF) {
		char	ipAddr[20];
		tstrM2MIPConfig* pstrM2MIpConfig = (tstrM2MIPConfig*) pvMsg;
		uint8 *pu8IPAddress = (uint8*) &pstrM2MIpConfig->u32StaticIP;

		gu32IPAddress = pstrM2MIpConfig->u32StaticIP;

		if(gstrAllStatus.u8Ap_status == SERVICE_IS_RUNNING) {
			gstrAllStatus.u8Ap_status = SERVICE_DEV_IS_CONNECTED;
			M2M_INFO("STA IP Address \"%u.%u.%u.%u\"\r\n",pu8IPAddress[0],pu8IPAddress[1],pu8IPAddress[2],pu8IPAddress[3]);
		}
		else {
			if(gstrAllStatus.u8P2p_status != SERVICE_IS_RUNNING) {
				gstrAllStatus.u8Sta_status = SERVICE_IS_RUNNING;
			}
			else {
				gstrAllStatus.u8P2p_status = SERVICE_DEV_IS_CONNECTED;
			}
			M2M_INFO("DHCP IP Address \"%u.%u.%u.%u\"\r\n",pu8IPAddress[0],pu8IPAddress[1],pu8IPAddress[2],pu8IPAddress[3]);
			gu8Sleep = PS_REQ_SLEEP;
		}

		/* Send the IP Address along with the '+OK' Response.
		*/
		sprintf(ipAddr, "%u.%u.%u.%u",pu8IPAddress[0],pu8IPAddress[1],pu8IPAddress[2],pu8IPAddress[3]);
		AT_SEND_OK(ipAddr);
	}
	else if (u8MsgType == M2M_WIFI_REQ_DHCP_FAILURE) {
		AT_SEND_ERROR(u8MsgType, "Failed to renew or obtain DHCP IP Address\r\n");
	}
	else if(u8MsgType == M2M_WIFI_RESP_CONN_INFO)
	{
		tstrM2MConnInfo		*pstrConnInfo = (tstrM2MConnInfo*)pvMsg;

		M2M_INFO("SSID  : %s\n",pstrConnInfo->acSSID);
		M2M_INFO("RSSI  : %d\n",pstrConnInfo->s8RSSI);
		M2M_INFO("SEC   : %d\n",pstrConnInfo->u8SecType);
		M2M_INFO("IP ADDR: %u.%u.%u.%u\n",pstrConnInfo->au8IPAddr[0],pstrConnInfo->au8IPAddr[1],
			pstrConnInfo->au8IPAddr[2],pstrConnInfo->au8IPAddr[3]);
		M2M_INFO("MAC ADDRESS : [%2x:%2x:%2x:%2x:%2x:%2x] \n",pstrConnInfo->au8MACAddress[0],pstrConnInfo->au8MACAddress[1],
			pstrConnInfo->au8MACAddress[2],pstrConnInfo->au8MACAddress[3],pstrConnInfo->au8MACAddress[4],
			pstrConnInfo->au8MACAddress[5]);
		char u8Buf[85];
		sprintf(u8Buf,"GET_CONN_INFO,%s,%d,%d,%u.%u.%u.%u,%02X:%02X:%02X:%02X:%02X:%02X", pstrConnInfo->acSSID,pstrConnInfo->s8RSSI,pstrConnInfo->u8SecType,pstrConnInfo->au8IPAddr[0],pstrConnInfo->au8IPAddr[1],
			pstrConnInfo->au8IPAddr[2],pstrConnInfo->au8IPAddr[3],pstrConnInfo->au8MACAddress[0],pstrConnInfo->au8MACAddress[1],
			pstrConnInfo->au8MACAddress[2],pstrConnInfo->au8MACAddress[3],pstrConnInfo->au8MACAddress[4],
			pstrConnInfo->au8MACAddress[5]);
		AT_SEND_OK(u8Buf);
	}
	else if (u8MsgType == M2M_WIFI_RESP_IP_CONFLICT) {
		if (gstrAllStatus.u8Sta_status != SERVICE_IS_STOPPED) {
			gu8Sleep = PS_WAKE;
		}
	}
	else if (u8MsgType == M2M_WIFI_RESP_CURRENT_RSSI) {
		sint8	*rssi = (sint8*)pvMsg;
		get_cmd_txt(AT_INDEX_RSSI, (uint8 *)au8CmdTxt);
		
		gu8Sleep = PS_REQ_SLEEP;
		M2M_INFO("ch rssi %d\r\n",*rssi);
		AT_SEND_OK(au8CmdTxt);
	}
	else if(u8MsgType == M2M_WIFI_RESP_PROVISION_INFO) {
		pstrProvInfo = (tstrM2MProvisionInfo*)pvMsg;

		gstrAllStatus.u8Prov_status = SERVICE_IS_STOPPED;
		if(pstrProvInfo->u8Status == M2M_SUCCESS) {
			get_cmd_txt(AT_INDEX_PROV_ENABLE, (uint8 *)au8CmdTxt);
			AT_SEND_OK(au8CmdTxt);
			m2m_wifi_connect((char*)pstrProvInfo->au8SSID, strlen((const char *)pstrProvInfo->au8SSID), pstrProvInfo->u8SecType,
				pstrProvInfo->au8Password, M2M_WIFI_CH_ALL);
		}
		else if(pstrProvInfo->u8Status == 255) {
			M2M_ERR("Provisioning Terminated\n");
		}
		else {
			M2M_ERR("Provisioning Failed\n");
			AT_SEND_ERROR(pstrProvInfo->u8Status,"PROV_MODE");
		}
	}
	else if(u8MsgType == M2M_WIFI_REQ_WPS) {
		tstrM2MWPSInfo	*pstrWPS = (tstrM2MWPSInfo*)pvMsg;
		gu8Sleep = PS_REQ_SLEEP;
		if(0 != pstrWPS->u8AuthType) {
			get_cmd_txt(AT_INDEX_WPS_START, (uint8 *)au8CmdTxt);
			AT_SEND_OK(au8CmdTxt);
			printf("WPS SSID           : %s\r\n",pstrWPS->au8SSID);
			printf("WPS PSK            : %s\r\n",pstrWPS->au8PSK);
			printf("WPS SSID Auth Type : %s\r\n",pstrWPS->u8AuthType == M2M_WIFI_SEC_OPEN ? "OPEN" : "WPA/WPA2");
			printf("WPS Channel        : %d\r\n",pstrWPS->u8Ch);
			m2m_wifi_connect((char*)pstrWPS->au8SSID, (uint8)m2m_strlen(pstrWPS->au8SSID),
				pstrWPS->u8AuthType, pstrWPS->au8PSK, pstrWPS->u8Ch);
		}
		else {
			M2M_ERR("WPS Is not enabled OR Timedout\n");
			AT_SEND_ERROR(u8MsgType,"WPS_MODE");
		}
	}
	else if(u8MsgType == M2M_WIFI_RESP_GET_SYS_TIME) {
		tstrSystemTime *pstrRsp = (tstrSystemTime *)pvMsg;
		M2M_INFO("Time: %02d:%02d:%02d of %02d/%02d/%02d", pstrRsp->u8Hour,pstrRsp->u8Minute,pstrRsp->u8Second,pstrRsp->u8Day,pstrRsp->u8Month, pstrRsp->u16Year);
	}
}

void GrowlCb(uint8 u8Code, uint8 u8ClientID)
{
	uint8 *cmdTxt[AT_MAX_CMD_LENGTH]={0};
#ifdef GROWL
#if defined PROWL || defined NMA
	//uint8 u8Retry = 4;
	static uint8 u8NoCb = 0;
	u8NoCb++;
	if (u8NoCb == gstrAllStatus.u8GrowlNumOfCBs)
	{
		gu8GrowlRsvd = 1;
		u8NoCb = 0;
		gstrAllStatus.u8GrowlNumOfCBs = 0;
		gu8Sleep = PS_REQ_SLEEP;
	}

	if(PROWL_CLIENT == u8ClientID){
		get_cmd_txt(AT_INDEX_PROWL, (uint8 *)cmdTxt);
	}
	else if(NMA_CLIENT == u8ClientID){
		get_cmd_txt(AT_INDEX_NMA, (uint8 *)cmdTxt);
	}

	if (u8Code != GROWL_SUCCESS) {
		AT_SEND_ERROR(u8Code, cmdTxt);
	} else {
		AT_SEND_OK(cmdTxt);
	}
#else 
	gu8GrowlRsvd = 1;
	gu8Sleep = PS_REQ_SLEEP;
#endif
#endif
}

