MicrochipTech/AzureDemo_AVR-IoT_Wx/winc-fw-upgrade/flashing_env/WINC1500_IoT_REL_19_6_1_30MAY2018_ATmega4808-4809/src/Tools/at_commands/main.c
#ifdef TEST_TLS
static void ssl_cb(uint8 u8MsgType, void * pvMsg)
{
	switch(u8MsgType)
	{
		case M2M_SSL_REQ_ECC:
		{
			tstrEccReqInfo *pstrEccREQ = (tstrEccReqInfo *)pvMsg;
			eccProcessREQ(pstrEccREQ);
		}
		break;
		case M2M_SSL_RESP_SET_CS_LIST:
		{
			tstrSslSetActiveCsList *pstrCsList = (tstrSslSetActiveCsList *)pvMsg;
			M2M_INFO("ActiveCS bitmap:%04x\n", pstrCsList->u32CsBMP);
		}
		break;
		case M2M_SSL_RESP_WRITE_OWN_CERTS:
		{
			tenuTlsFlashStatus enuStatus = *(tenuTlsFlashStatus *)pvMsg;
			M2M_INFO("Write TLS Client auth certificate:%d", enuStatus);
		}
		break;
	}
}
#endif

static void disable_pullups(void)
{
	uint32 pinmask;
	pinmask = (
	M2M_PERIPH_PULLUP_DIS_HOST_WAKEUP|
	M2M_PERIPH_PULLUP_DIS_SD_CMD_SPI_SCK|
	M2M_PERIPH_PULLUP_DIS_SD_DAT0_SPI_TXD);

	m2m_periph_pullup_ctrl(pinmask, 0);
}

static void set_dev_name_to_mac(uint8 * name, uint8 * mac_addr)
{
	/* Name must be in the format WINC1500_00:00 */
	uint16 len;

	len = m2m_strlen(name);
	if(len >= 5) {
		name[len-1] = HEX2ASCII((mac_addr[5] >> 0) & 0x0f);
		name[len-2] = HEX2ASCII((mac_addr[5] >> 4) & 0x0f);
		name[len-4] = HEX2ASCII((mac_addr[4] >> 0) & 0x0f);
		name[len-5] = HEX2ASCII((mac_addr[4] >> 4) & 0x0f);
	}
}


#define N_HTTPS_FILES									(sizeof(gpacHTTPSFileList)/ 256)

typedef struct{
	tstrHTTPClient	*hHTTPClientHandle;
	uint32			u32RxCount;
	char			acFileName[256];
}tstrHTTPSession;
#define URL_MAX_LEN 256
static volatile uint8	gbHttpClientTestActive	= 0;
static volatile uint8	gbIsHTTPSSessionRunning	= 0;
static volatile	uint8	gbIsTestFinished		= 0;
static tstrHTTPSession	gstrHTTPSSession;
static char				gpacHTTPSFileList[][URL_MAX_LEN] =
{
	"http://www.google.com",
	//"http://192.168.0.103:8090/ncf_ota/m2m_ota_3a0.bin",
	//"https://www.hsbc.com.eg/1/PA_esf-ca-app-content/content/pws/eg/egypt/pdf/electronic-banking-terms-and-conditions.pdf",
	//"https://ssl.gstatic.com/gb/images/b_8d5afc09.png",
	//"https://www.google.com.eg/images/srpr/logo11w.png",
	//"https://sni.velox.ch",
};

void set_download_url(char* u8Buf)
{
	memcpy(gpacHTTPSFileList[0],u8Buf,URL_MAX_LEN);
}
/***********************************************************/
void http_client_test_init(void)
{
	memset(&gstrHTTPSSession, 0, sizeof(tstrHTTPSession));
	gbIsHTTPSSessionRunning	= 0;
	gbIsTestFinished		= 0;
	gbHttpClientTestActive	= 1;
	HTTP_ClientInit();
	gstrSslOptions.bIsSessionCachingEnabled = 1;
	
	M2M_ERR("Test Init\r\n");
}

/***********************************************************/
static sint8 httpsClientCallback(uint8 *pu8Chunk, sint16 s16ChunkSize, uint32 u32Arg)
{
	tstrHTTPSession		*pstrSession = (tstrHTTPSession*)u32Arg;
	static uint32 u32FileSize = 0;
	float fDownloadTime = 0.0;
	float fBitRate = 0.0;

	if(pu8Chunk == NULL)
	{
		if(s16ChunkSize == HTTP_CLIENT_CONNECTED)
		{
			/* Add Call back action */
		}
		else if(s16ChunkSize == HTTP_CLIENT_DOWNLOADING)
		{
			u32FileSize = gstrHTTPSSession.hHTTPClientHandle->strRxMsg.u32ContentLength;
			M2M_INFO("File size: %lu B\n",u32FileSize);
		}
		else if(s16ChunkSize == HTTP_CLIENT_FINISHED)
		{
			fDownloadTime = (float)GetDownloadTime()/(float)1000;
			fBitRate = u32FileSize/(1024 * fDownloadTime);
			M2M_INFO("\"%s\" Success\n", pstrSession->acFileName);
			HTTP_ClientStop(pstrSession->hHTTPClientHandle);
			M2M_INFO("Download time = %10.3f s @ Rate: %5.3f KB/s\n", fDownloadTime,fBitRate);
			gbIsHTTPSSessionRunning = 0;
			AT_SEND_OK("FILE_DOWNLOAD");
		}
		else if(s16ChunkSize == HTTP_CLIENT_CONNECTION_ERROR)
		{
			M2M_INFO("\"%s\" Fail!\n", pstrSession->acFileName);
			HTTP_ClientStop(pstrSession->hHTTPClientHandle);
			gbIsHTTPSSessionRunning = 0;
			AT_SEND_ERROR(s16ChunkSize, "FILE_DOWNLOAD");
		}
	}
	return 0;
}

/***********************************************************/
static void at_http_test_task(void)
{
	static uint32	u32ServerIdx = 0;

	if(!GetFiledownloadStarted())
	return;

	if(!gbHttpClientTestActive)
	return;

	if(!gbIsTestFinished)
	{
		if(!gbIsHTTPSSessionRunning)
		{
			if(u32ServerIdx < N_HTTPS_FILES)
			{
				gbIsHTTPSSessionRunning		= 1;
				gstrHTTPSSession.u32RxCount = 0;
				strcpy(gstrHTTPSSession.acFileName, gpacHTTPSFileList[u32ServerIdx]);
				gstrHTTPSSession.hHTTPClientHandle =
				HTTP_ClientConnect(gpacHTTPSFileList[u32ServerIdx], HTTP_CLIENT_ACTION_DOWNLOAD, 0, httpsClientCallback,
				(uint32)&gstrHTTPSSession);
				u32ServerIdx ++;
			}
			else
			{
#ifndef __REPEAT_TEST_CONTINUOUSLY__
				M2M_DBG("Test Finished\n");
				system("start .\\Download");
				gbIsTestFinished = 1;
				gbHttpClientTestActive = 0;
#endif
				u32ServerIdx = 0;
			}
		}
	}
}

sint8 winc_reset(uint8 reinit, uint8 bConnect, uint8 mode)
{
    uint8 mac_addr[6];
    uint8 u8IsMacAddrValid;
    tstrM2mLsnInt strM2mLsnInt;
    sint8 s8Ret = M2M_ERR_FAIL;

#ifdef ETH_MODE
    gstrWifiParam.strEthInitParam.u8EthernetEnable = mode;
    M2M_INFO("Mode:%d\n", mode);
#endif

    /* WIFI re-init, forces a deinit before the init */
    if(reinit)
        s8Ret = m2m_wifi_reinit(&gstrWifiParam);
    else
        s8Ret = m2m_wifi_init(&gstrWifiParam);

    if (M2M_SUCCESS != s8Ret) {
        /* Could be really bad, but we will hope it is just a version mismatch
           so we cannot do the AT cmd app stuff, but we can do Serial bridge mode. */
        M2M_ERR("Initialization error(%d): Switching to recovery mode (SB)\r\n", s8Ret);
        if(s8Ret != M2M_ERR_FW_VER_MISMATCH)
        {
            /* Just get framework in place for upgrade. No need to reinit. */
            m2m_wifi_init_hold();
        }
        enter_wifi_firmware_download(); /* Never returns... */
        while(1);
    }

    /* Reconfigure the callbacks and reconnect to the network after completing the WINC reinit */
    m2m_ota_init(OtaUpdateCb, OtaNotifCb);

    disable_pullups();

#ifdef TEST_TLS
    s8Ret = m2m_ssl_init(ssl_cb);
    if (M2M_SUCCESS != s8Ret)
    {
        M2M_ERR("m2m_ssl_init() failed with ret=%d", s8Ret);
        goto EXIT;
    }
#endif

#ifdef TEST_IPERF
    IperfInit();
#endif

