MicrochipTech/AzureDemo_AVR-IoT_Wx/winc-fw-upgrade/flashing_env/WINC1500_IoT_REL_19_6_1_30MAY2018_ATmega4808-4809/src/Tools/at_commands/main.c
    if(IsSocketReady())
        socketDeinit();

    socketInit();

    m2m_wifi_get_otp_mac_address(mac_addr, &u8IsMacAddrValid);
    if(!u8IsMacAddrValid) {
        M2M_INFO("Default MAC\r\n");
        m2m_wifi_set_mac_address(gau8MacAddr);
    } else {
        M2M_INFO("OTP MAC\r\n");
    }
    m2m_wifi_get_mac_address(gau8MacAddr);
    M2M_INFO("MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\r\n",
    gau8MacAddr[0],gau8MacAddr[1],gau8MacAddr[2],
    gau8MacAddr[3],gau8MacAddr[4],gau8MacAddr[5]);

    set_dev_name_to_mac((uint8*)gacDeviceName, gau8MacAddr);
//    set_dev_name_to_mac((uint8*)gstrM2MAPConfig.au8SSID, gau8MacAddr);
    m2m_wifi_set_device_name((uint8*)gacDeviceName, (uint8)m2m_strlen((uint8*)gacDeviceName));

#ifdef TEST_POWER_SAVE
    M2M_INFO("M2M_PS_DEEP_AUTOMATIC\r\n");
    m2m_wifi_set_sleep_mode(M2M_PS_DEEP_AUTOMATIC, 1);
#else
    M2M_PRINT("NO POWER SAVE mode\n");
    m2m_wifi_set_sleep_mode(M2M_NO_PS, 1);
#endif

    strM2mLsnInt.u16LsnInt = M2M_LISTEN_INTERVAL;
    m2m_wifi_set_lsn_int(&strM2mLsnInt);

    memset((char *)&gstrAllStatus, 0, sizeof(tstr_test_conn_status));

    if(bConnect)
        if(M2M_SUCCESS != m2m_wifi_default_connect())     /* Don't change s8Ret */
            M2M_ERR("Failed to connect!\n");

EXIT:
    return s8Ret;
}
/***********************************************************/

static sint8 init_m2m_app(void)
{
    sint8 s8Ret = M2M_SUCCESS;
//    gstrAllStatus.u8Sta_status = SERVICE_IS_STOPPED;
    gu8GrowlRsvd = 1;
    gu8Sleep = PS_REQ_SLEEP;
    gstrAllStatus.u8Wps_status = WPS_DISABLED;
    gu8Prov = PROV_DISABLED;
    aws_data_t cryptodata;
    uint8 iSockCID;

    memset(gau8SocketTestBuffer,0,sizeof(gau8SocketTestBuffer));
    memset(&gHTTPInfo,0,sizeof(HTTP_RXInfo));
    memset(gHTTPport,0,AT_MAX_PARAM_LENGTH);

    gHTTPChecksum = 0;
    gTLS = 0;
    gHTTPsock = -1;

    nm_bsp_start_timer(timer_cb, TIMER_RES);

#ifdef _STATIC_PS_
    nm_bsp_register_wake_isr(wake_cb, PS_SLEEP_TIME_MS);
#endif
    m2m_memset((uint8*)&gstrWifiParam, 0, sizeof(gstrWifiParam));
    gstrWifiParam.pfAppWifiCb = wifi_cb;

#ifdef TEST_TLS
    ATCAIfaceCfg tls_atecc508a;

    // Initialize the ATECC508A
    tls_atecc508a = cfg_ateccx08a_i2c_default;

#if defined(__SAML21J18B__) || defined(__SAMD21J18A__)
    // Use SERCOM2 as the WINC uses SERCOM0
    tls_atecc508a.atcai2c.bus = 2;
#elif defined(__SAM4SD32C__)
    // Use TWI0
    tls_atecc508a.atcai2c.bus = 0;
#endif

    tls_atecc508a.atcai2c.slave_address = 0xB0; // AWS provisioned devices use the B0 address

    s8Ret = eccInit(&tls_atecc508a);
    if (M2M_SUCCESS == s8Ret) {
        if(eccReadAWSData(&cryptodata) != ATCA_SUCCESS)
        {
            s8Ret = M2M_ERR_FAIL;
            printf("CryptoReadAWSData() failed with ret=%d\r\n", s8Ret);
            return s8Ret;
        }
    }
#endif

#ifdef TEST_IPERF
    use_static_IP = 0;
    m2m_memset((uint8*)&StaticIPcfg, 0, sizeof(StaticIPcfg));

    first_SockConn = NULL;

    for(iSockCID=0; iSockCID<MAX_SOCKET; iSockCID++)
        sCID[iSockCID] = iSockCID;
#endif

    s8Ret = winc_reset(0, 0, M2M_WIFI_MODE_NORMAL);
    if(M2M_SUCCESS != s8Ret)
        return s8Ret;

    init_at_cmd_handler(gastrAtCMD_Handler);

#ifdef DEBUG_CMD
	print_cmd_handler_arr(gastrAtCMD_Handler);
#endif

    return M2M_SUCCESS;
}

static void start_m2m_app(void)
{
    uint32_t timeout = 0;
    serial_input_reset();
    at_cmd_init((uint8*)&gstrAllStatus);

    // These three lines are needed for smoketest.bat
    puts("DONE\r\n");
    AT_SEND_OK("Init");
    printf("\rNow,You can send CMD or use HELP for help.\r\n");

    /*-------------------------------------------------------------------------*
     *                                Main Loop                                *
     *-------------------------------------------------------------------------*
     */

    while (true)
    {
        /*---------------------------------------------------------------------*
         *                         Process AT Command                          *
         *---------------------------------------------------------------------*
         */
        if (!buffered_uart_is_empty()) {
            int r; 
            char c;

            while (!buffered_uart_is_empty()) {
                c = buffered_uart_getchar();
                r = serial_input_parse(c);

                if(at_cmd_cfg_is_echo_on() && r != SERIAL_INPUT_SBMODE) {
                    M2M_PRINT("%c", c);

                    // Send an empty space to remove the last char from the users terminal, then backspace again
                    if(r == SERIAL_INPUT_BACKSPACE)
                        M2M_PRINT(" \x08");
                }

                if (r != SERIAL_INPUT_WAITING_MORE_DATA) {
                    timeout = 0;
                    break;
                }
            }

            switch (r) {
                case SERIAL_INPUT_SBMODE:
                    at_sb_printf = &sb_printf;
                    gu8WDog = 0;
                    m2m_wifi_reinit_hold();
                    enter_wifi_firmware_download();
                    break;
                case SERIAL_INPUT_WAITING_MORE_DATA:
                case SERIAL_INPUT_BACKSPACE:
                    if (timeout == 0) {
                        timeout = tick + CMD_TIMEOUT;
                        if (timeout == 0) {
                            timeout = 1;
                        }
                    }
                    break;
                case SERIAL_INPUT_VALID:
                    at_cmd_run(serial_input_get_buffer());
                    serial_input_reset();
                    gu8WDog = 0;
                    break;
                case SERIAL_INPUT_NEW_LINE:
                    break;
                case SERIAL_INPUT_INVALID:
                default:
                    M2M_PRINT(":Invalid Input %c\r\n", c);
                    serial_input_reset();
                    ++gu8WDog;
                    break;
            }
        }

#if 0
        if(ENABLED == gtstrApp_config.restart_app){
            break;
        }
#endif

