MicrochipTech/AzureDemo_AVR-IoT_Wx/winc-fw-upgrade/flashing_env/WINC1500_IoT_REL_19_6_1_30MAY2018_ATmega4808-4809/src/Tools/at_commands/main.c
#ifdef TEST_IPERF
        IperfUpdate();
#endif

        while(m2m_wifi_handle_events(NULL) != M2M_SUCCESS) {
        }

        at_http_test_task();

#if (defined _STATIC_PS_)||(defined _DYNAMIC_PS_)
        if (
            (gstrAllStatus.u8Sta_status == SERVICE_IS_RUNNING) && (gu8GrowlRsvd) &&
            (gstrAllStatus.u8Wps_status == WPS_DISABLED) &&
            (gu8Prov == PROV_DISABLED)
        ) {
            if (gu8Sleep == PS_REQ_SLEEP)
            {
#ifdef _STATIC_PS_
                m2m_wifi_request_sleep();
                gu8Sleep = PS_SLEEP;
                nm_bsp_wake_ctrl(1);
#endif
                nm_bsp_enable_mcu_ps();
            }
        }
#endif
    }

}

int main (void)
{
    sint8 ret = M2M_SUCCESS;
    at_sb_printf = &printf;

#if defined(__SAML21J18B__) || defined(__SAMD21J18A__)
    system_init();

    /* Enable SysTick interrupt for non busy wait delay. */
    if (SysTick_Config(system_cpu_clock_get_hz() / 1000)) {
        puts("main: SysTick configuration error!");
        return 0;
    }
#elif defined(__SAM4SD32C__) || defined(__SAMG53N19__)
    sysclk_init();
    board_init();

    /* Enable SysTick interrupt for non busy wait delay. */
    if (SysTick_Config(sysclk_get_cpu_hz() / 1000)) {
        goto HALT;
    }
#endif

    /* Initialize the UART console. */
    buffered_uart_init(CONF_STDIO_BAUDRATE);

    /*Print Welcome Message and starting of initialization*/
    printf(STRING_HEADER);
    printf("Initializing BSP...");

    ret = nm_bsp_init();
    if (ret != M2M_SUCCESS) {
        M2M_ERR("\r\nFailed to initialize BSP.");
        AT_SEND_ERROR(ret,"BSP Init");
        goto HALT;
    }

    ret = nm_bsp_app_init();
    if (ret != M2M_SUCCESS) {
        M2M_ERR("\r\nFailed to initialize BSP App.");
        AT_SEND_ERROR(ret,"BSP App Init");
        goto HALT;
    }

    puts("DONE\r\n");
    printf("Initializing APP...\n");

    ret = init_m2m_app();
    if (ret != M2M_SUCCESS) {
        M2M_ERR("\r\nFailed to initialize APP.");
        AT_SEND_ERROR(ret,"APP Init");

        /* If all else fails, try to load serial bridge */
        if(ret != M2M_ERR_FW_VER_MISMATCH)
        {
            /* Just get framework in place for upgrade */
            m2m_wifi_init_hold();
        }
        enter_wifi_firmware_download(); /* Never returns */
        goto HALT;
    }

    // Main loop
    start_m2m_app();

#if 0
    if(ENABLED == gtstrApp_config.u8Restart_app){
        printf("\r\n\n Restarting APP...\r\n");
        gtstrApp_config.u8Restart_app = DISABLED;
        goto START;
    }
#endif

HALT:
    while(1){
        /*Infinite Loop*/
    }
}
